my_tuple = (1, 2, 3, 4, 5)
print(my_tuple[0:2])


numbers = (2, 56, 99, 22, 15, 23, 66, 11, 134, 23, 66, 91, 22, 2, 23)
count_23 = numbers.count(23)
print(count_23) 


aura = (10, 25, 5, 80, 70, 20)
for number in aura:
    if number > 10:
        print(number)

#List და Tuple განსხვავდება იმით, რომ list არის mutable (შეცვლადი) და tuple არის immutable (არასიმძლავრი). 
# ეს ნიშნავს, რომ list-დან შეგვიძლია ელემენტების დამატება, წაშლა და შეცვლა, ხოლო tuple-ის ელემენტების შეცვლა შეუძლებელია.

# Immutable ნიშნავს, რომ ობიექტი ვერ შეიცვლება მას შემდეგ, რაც ის შექმნილია. Mutable კი ნიშნავს, 
# რომ ობიექტის მდგომარეობა (სათავსო) შესაძლებელია შეიცვალოს. 
